app/controllers/cars_controller.rb

SELECT "bodies".* FROM "bodies"
SELECT "features".* FROM "features"
---
  def new
    @car = Car.new
    @bodies = Body.all
    @features = Feature.all

INSERT INTO "cars" ("body_id", "brand", "created_at", "model", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body_id", 1], ["brand", "Traktor"], ["created_at", "2014-11-03 03:24:36.359839"], ["model", "Ursus"], ["price", 1], ["updated_at", "2014-11-03 03:24:36.359839"]]
INSERT INTO "assembly_lines" ("car_id", "created_at", "feature_id", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 8], ["created_at", "2014-11-03 14:12:05.954808"], ["feature_id", 1], ["updated_at", "2014-11-03 14:12:05.954808"]]
---
  def create
    @car = Car.new(params_permitted)
    if(@car.save)
      @car.body_id = params[:body][:body_id]
      params[:feature_ids].each do |f|
        assembly = AssemblyLine.new
        assembly.car_id = @car.id
        assembly.feature_id = f
        assembly.save

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bodies".* FROM "bodies"
SELECT "features".* FROM "features"
---
  def edit
    @car = Car.find(params[:id])
    @bodies = Body.all
    @features = Feature.all

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cars" SET "model" = ?, "updated_at" = ? WHERE "cars"."id" = 2  [["model", "Passat"], ["updated_at", "2014-11-03 01:09:19.619729"]]
SELECT "assembly_lines".* FROM "assembly_lines"  WHERE "assembly_lines"."car_id" = ?  [["car_id", 3]]
INSERT INTO "assembly_lines" ("car_id", "created_at", "feature_id", "updated_at") VALUES (?, ?, ?, ?)  [["car_id", 3], ["created_at", "2014-11-03 14:14:35.008916"], ["feature_id", 1], ["updated_at", "2014-11-03 14:14:35.008916"]]
---
  def update
    @car = Car.find(params[:id])
    @car.body_id = params[:body][:body_id]
    if(@car.update params_permitted)
      @car.assembly_lines.each do |a|
        a.destroy
      end
      params[:feature_ids].each do |f|
        assembly = AssemblyLine.new
        assembly.car_id = @car.id
        assembly.feature_id = f
        assembly.save

SELECT  "cars".* FROM "cars"  WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
  def destroy
    @car = Car.find(params[:id])
    @car.destroy