app/controllers/features_controller.rb

SELECT "features".* FROM "features"
---
  def index
    @features = Feature.all

INSERT INTO "features" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-03 12:33:01.471921"], ["name", "bufs"], ["price", 143], ["updated_at", "2014-11-03 12:33:01.471921"]]
---
  def create
    @feature = Feature.new(params_permitted)
    if(@feature.save)

SELECT  "features".* FROM "features"  WHERE "features"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @feature = Feature.find(params[:id])

SELECT  "features".* FROM "features"  WHERE "features"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @feature = Feature.find(params[:id])

SELECT  "features".* FROM "features"  WHERE "features"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "features" SET "price" = ?, "updated_at" = ? WHERE "features"."id" = 1  [["price", 150], ["updated_at", "2014-11-03 12:30:37.282936"]]
---
  def update
    @feature = Feature.find(params[:id])
    if(@feature.update params_permitted)

SELECT  "features".* FROM "features"  WHERE "features"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "features" WHERE "features"."id" = ?  [["id", 2]]
---
  def destroy
    @feature = Feature.find(params[:id])
    @feature.destroy