app/views/cars/_form.html.haml

    = c.label :Body
    = select(:body, :body_id, @bodies.map { |body| ["#{body.name} - #{body.doors} doors", body.id] })
---
SELECT "bodies".* FROM "bodies"