app/views/cars/index.html.haml

          %td
            -c.features.each do |f|
---
SELECT "features".* FROM "features" INNER JOIN "assembly_lines" ON "features"."id" = "assembly_lines"."feature_id" WHERE "assembly_lines"."car_id" = ?  [["car_id", 1]]